# Python basics

In [4]:
print("aaa")

aaa

In [5]:
x = 1
y = 2
x + y

3

In [6]:
def addit(a, b):
    return a+b

In [8]:
addit(x, y)

3

In [9]:
lst = ["a","b","c","d"]
for element in lst:
    print(element)

a
b
c
d

In [10]:
if x < y:
    print("lower")
else:
    print("bigger or equal")

lower

In [11]:
dictionary = {
    'key1': 1,
    'key2': 2,
    'key3': 3
}
dictionary

{'key1': 1, 'key2': 2, 'key3': 3}

In [12]:
dictionary.items()

dict_items([('key1', 1), ('key2', 2), ('key3', 3)])

In [13]:
for k, v in dictionary.items():
    print(k)
    print(v)
    print("---")

key1
1
---
key2
2
---
key3
3
---

In [14]:
import pandas as pd

df = pd.DataFrame({
    'col1': ['a','b','c'],
    'col2': [1,2,3],
    'col3': [20,30,40]
})
df

  col1  col2  col3
0    a     1    20
1    b     2    30
2    c     3    40

## Basic operations: Column selection

In [15]:
df.col1

0    a
1    b
2    c
Name: col1, dtype: object

In [16]:
df["col1"]

0    a
1    b
2    c
Name: col1, dtype: object

In [17]:
df[["col1", "col2"]]

  col1  col2
0    a     1
1    b     2
2    c     3

In [18]:
df.index = ['row1','row2','row3']

In [19]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

## Basic operations: row selection

# df.loc[ ROWS_LST   , COLUMNS_LST]

# df.loc[   ["row1","row2"]   ,    :    ]

In [20]:
df.loc[["row1","row2"],:]

     col1  col2  col3
row1    a     1    20
row2    b     2    30

In [21]:
df.loc[["row1","row2"], ["col1", "col2"]]

     col1  col2
row1    a     1
row2    b     2

In [22]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

# df.iloc[   ROWS_POS , COL_POS   ]

In [23]:
df.iloc[  [0,2]  , [0,1]   ]

     col1  col2
row1    a     1
row3    c     3

In [ ]:
lst = ["a", "b", "c", "d", "e", "f"]


# SLICER SYNTAX:     [     FROM : TO        ]

# SLICER SYNTAX ONE-WAY  [ FROM : ]

# SLICER SYNTAX ONE-WAY [  :  TO ]

In [28]:
lst[1:5]

['b', 'c', 'd']

In [31]:
lst[:3], lst[2:], lst[:-3]

(['a', 'b', 'c'], ['c', 'd'], ['a'])

In [32]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

In [36]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

In [38]:
df_num = df[["col2", "col3"]]
df_num

      col2  col3
row1     1    20
row2     2    30
row3     3    40

In [39]:
df_num.sum(axis=0)

col2     6
col3    90
dtype: int64

In [40]:
df_num.sum(axis=1)

row1    21
row2    32
row3    43
dtype: int64

In [41]:
df_num

      col2  col3
row1     1    20
row2     2    30
row3     3    40

In [42]:
df_num.apply(lambda x: x+10, axis=0)

      col2  col3
row1    11    30
row2    12    40
row3    13    50

In [43]:
df_num.apply(lambda x: x+10, axis=1)

      col2  col3
row1    11    30
row2    12    40
row3    13    50

In [44]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

In [49]:
df2 = pd.DataFrame({
    'col1': ['a', 'b', 'd'],
    'col4': [777, 888, 999]
})
df2

  col1  col4
0    a   777
1    b   888
2    d   999

In [50]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

In [52]:
pd.merge(df, df2, how="right", on="col1")

  col1  col2  col3  col4
0    a   1.0  20.0   777
1    b   2.0  30.0   888
2    d   NaN   NaN   999

In [65]:
df = pd.DataFrame({
    'country': ['PL', 'PL', 'USA', 'USA', "USA", "India", "India"],
    'age': [25, 20, 30, 35, 36, 20, 40],
    'height': [181, 171, 160, 150, 170, 191, 185],
    'city': ['Wroclaw', 'Warsaw', "NYC", "NYC", 'Washington', 'Delhi', 'Delhi']
})
df

   age        city country  height
0   25     Wroclaw      PL     181
1   20      Warsaw      PL     171
2   30         NYC     USA     160
3   35         NYC     USA     150
4   36  Washington     USA     170
5   20       Delhi   India     191
6   40       Delhi   India     185

In [66]:
import numpy as np

In [67]:
df.groupby(['country', 'city']).agg(
    {
    'age': [np.mean],
    'height': [np.sum, np.std]
    
}
)

                     age height
                    mean    sum       std
country city
India   Delhi       30.0    376  4.242641
PL      Warsaw      20.0    171       NaN
        Wroclaw     25.0    181       NaN
USA     NYC         32.5    310  7.071068
        Washington  36.0    170       NaN

In [72]:
df.groupby(["country", "city"]).sum()

                    age  height
country city
India   Delhi        60     376
PL      Warsaw       20     171
        Wroclaw      25     181
USA     NYC          65     310
        Washington   36     170

In [74]:
titanic_df = pd.DataFrame.from_csv(
"https://raw.githubusercontent.com/Animattronic/phd_materials/master/data_science/intro/data/titanic_train_data.csv",
header=0,
index_col=0
)

In [78]:
pd.value_counts(titanic_df["Sex"])

male      577
female    314
Name: Sex, dtype: int64

In [76]:
titanic_df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [91]:
titanic_df.groupby(["Pclass", "Sex"]).agg({"Age": [np.mean, np.std]})

                     Age
                    mean        std
Pclass Sex
1      female  34.611765  13.612052
       male    41.281386  15.139570
2      female  28.722973  12.872702
       male    30.740707  14.793894
3      female  21.750000  12.729964
       male    26.507589  12.159514

In [84]:
titanic_df.groupby(["Sex"]).agg(
    {"Survived": [
        lambda vec: np.sum(vec)/float(len(vec))
        ]
    })

        Survived
        <lambda>
Sex
female  0.742038
male    0.188908

In [82]:
pd.value_counts(titanic_df.Sex)

male      577
female    314
Name: Sex, dtype: int64

In [89]:
pd.pivot_table(
    titanic_df,
    index='Sex',
    columns='SibSp',
    aggfunc=np.sum,
    values='Survived'
)

SibSp     0   1   2  3  4  5  8
Sex
female  137  80  10  4  2  0  0
male     73  32   3  0  1  0  0

In [92]:
df

   age        city country  height
0   25     Wroclaw      PL     181
1   20      Warsaw      PL     171
2   30         NYC     USA     160
3   35         NYC     USA     150
4   36  Washington     USA     170
5   20       Delhi   India     191
6   40       Delhi   India     185

In [94]:
pd.value_counts(df.country)

USA      3
India    2
PL       2
Name: country, dtype: int64

In [97]:
lst = [3,1,2]
lst.sort()
lst

[1, 2, 3]

In [101]:
df

   age        city country  height
0   25     Wroclaw      PL     181
1   20      Warsaw      PL     171
2   30         NYC     USA     160
3   35         NYC     USA     150
4   36  Washington     USA     170
5   20       Delhi   India     191
6   40       Delhi   India     185

In [104]:
lst

[1, 2, 3]

In [109]:
list(df.age.sort_values())

[20, 20, 25, 30, 35, 36, 40]

In [111]:
list(df['age'])

[25, 20, 30, 35, 36, 20, 40]

In [112]:
pd.value_counts(df.city)

Delhi         2
NYC           2
Warsaw        1
Washington    1
Wroclaw       1
Name: city, dtype: int64

In [113]:
df.groupby('city').agg({'age':np.mean})

             age
city
Delhi       30.0
NYC         32.5
Warsaw      20.0
Washington  36.0
Wroclaw     25.0